<a href="https://colab.research.google.com/github/ShreePurvaja/Data-Science-Notes/blob/main/SQL_(constraints%2CJoins).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 24.02.2025

In [1]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.2.0-cp311-cp311-manylinux_2_28_x86_64.whl.metadata (6.0 kB)
Downloading mysql_connector_python-9.2.0-cp311-cp311-manylinux_2_28_x86_64.whl (34.0 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 34.0/34.0 MB 9.8 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.2.0

In [44]:
import mysql.connector

connection = mysql.connector.connect(
  host = "gateway01.ap-southeast-1.prod.aws.tidbcloud.com",
  port = 4000,
  user = "2yYzWuNLpsRGRUo.root",
  password = "LziV3VzKcgY6K7lq",
  database = "purvaja",
)

mycursor = connection.cursor()

In [3]:
!pip install tabulate     # gives the table format for the data

Requirement already satisfied: tabulate in /usr/local/lib/python3.11/dist-packages (0.9.0)

In [ ]:
#primarykey - not null + unique
#foreignkey - referenced from another table

#Basic property of Database
#ACID - Atomicity, Consistency, Isolation, Durability
# Automacity - all the operations should be atomic
# Consistency - all the operations should be consistent
# Isolation - all the operations should be isolated
# Durability - all the operations should be durable

In [6]:
mycursor.execute("CREATE TABLE guvi3.aadhardetails (name VARCHAR(30),ADDRESS VARCHAR(20),AADHARID INTEGER PRIMARY KEY)")

In [16]:
mycursor.execute("INSERT INTO guvi3.aadhardetails (name,address,aadharid) VALUES('Gowtham','Coimbatore',212606)")
connection.commit()

In [9]:
mycursor.execute("CREATE TABLE guvi3.bankacc(name VARCHAR(20),type VARCHAR(2),accno INT PRIMARY KEY,aadhar INT ,FOREIGN KEY (aadhar)REFERENCES aadhardetails(aadharid))")

In [17]:
mycursor.execute("INSERT INTO guvi3.bankacc (name,type,accno,aadhar) VALUES('Purvaja','FD',1138,212606)")
connection.commit()

In [19]:
mycursor.execute("select * from test.employees")
out=mycursor.fetchall()   # fetching all the data
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))   # psql is like

+----------+--------------+-------------+-----------------+----------+
|   emp_id | first_name   | last_name   |   department_id |   salary |
|----------+--------------+-------------+-----------------+----------|
|        1 | John         | Smith       |               1 |    50000 |
|        2 | Sarah        | Johnson     |               2 |    62000 |
|        3 | Michael      | Brown       |               1 |    55000 |
|        4 | Emily        | Davis       |               3 |    48000 |
|        5 | David        | Wilson      |               2 |    61000 |
|        6 | Lisa         | Anderson    |               4 |    53000 |
|        7 | James        | Taylor      |               1 |    54000 |
|        8 | Emma         | Martinez    |               2 |    59000 |
|        9 | Daniel       | Thomas      |               3 |    51000 |
|       10 | Jessica      | Garcia      |               5 |    57000 |
+----------+--------------+-------------+-----------------+----------+

In [20]:
mycursor.execute("select * from test.departments")
out=mycursor.fetchall()   # fetching all the data
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))   # psql is like

+-----------------+-------------------+---------------+----------+
|   department_id | department_name   | location      |   budget |
|-----------------+-------------------+---------------+----------|
|               1 | IT                | New York      |   500000 |
|               2 | Marketing         | Los Angeles   |   400000 |
|               3 | Finance           | Chicago       |   450000 |
|               4 | HR                | Boston        |   300000 |
|               5 | Sales             | Miami         |   550000 |
|               6 | Research          | Seattle       |   600000 |
|               7 | Operations        | Denver        |   350000 |
|               8 | Legal             | Washington DC |   425000 |
|               9 | Support           | Austin        |   275000 |
|              10 | Development       | San Francisco |   700000 |
+-----------------+-------------------+---------------+----------+

In [24]:
mycursor.execute("select * from test.projects")
out=mycursor.fetchall()   # fetching all the data
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))   # psql is like

+--------------+--------------------+----------+--------------+-------------+
|   project_id | project_name       |   emp_id | start_date   | status      |
|--------------+--------------------+----------+--------------+-------------|
|            1 | Website Redesign   |        1 | 2024-01-15   | In Progress |
|            2 | Mobile App         |        2 | 2024-02-01   | Planning    |
|            3 | Database Migration |        3 | 2024-01-10   | Completed   |
|            4 | Security Audit     |        4 | 2024-03-01   | In Progress |
|            5 | Cloud Migration    |        1 | 2024-02-15   | Planning    |
|            6 | AI Implementation  |        5 | 2024-01-20   | On Hold     |
|            7 | CRM Update         |        7 | 2024-02-10   | In Progress |
|            8 | Network Upgrade    |        8 | 2024-03-05   | Planning    |
|            9 | Data Analytics     |        9 | 2024-01-05   | Completed   |
|           10 | DevOps Pipeline    |        3 | 2024-02-20   | In Progress |
+--------------+--------------------+----------+--------------+-------------+

In [25]:
#Right Join - returns all the data from the right table

mycursor.execute("""SELECT e.first_name,e.last_name,d.department_name,d.department_id
FROM test.employees e
right JOIN test.departments d ON e.department_id=d.department_id""")
out=mycursor.fetchall()   # fetching all the data
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))   # psql is like

+--------------+-------------+-------------------+-----------------+
| first_name   | last_name   | department_name   |   department_id |
|--------------+-------------+-------------------+-----------------|
| John         | Smith       | IT                |               1 |
| Sarah        | Johnson     | Marketing         |               2 |
| Michael      | Brown       | IT                |               1 |
| Emily        | Davis       | Finance           |               3 |
| David        | Wilson      | Marketing         |               2 |
| Lisa         | Anderson    | HR                |               4 |
| James        | Taylor      | IT                |               1 |
| Emma         | Martinez    | Marketing         |               2 |
| Daniel       | Thomas      | Finance           |               3 |
| Jessica      | Garcia      | Sales             |               5 |
|              |             | Research          |               6 |
|              |             | Operations        |               7 |
|              |             | Legal             |               8 |
|              |             | Support           |               9 |
|              |             | Development       |              10 |
+--------------+-------------+-------------------+-----------------+

In [26]:
#left Join - returns all the data from the left table

mycursor.execute("""SELECT e.first_name,e.last_name,d.department_name,d.department_id
FROM test.employees e
left JOIN test.departments d ON e.department_id=d.department_id""")
out=mycursor.fetchall()   # fetching all the data
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))   # psql is like

+--------------+-------------+-------------------+-----------------+
| first_name   | last_name   | department_name   |   department_id |
|--------------+-------------+-------------------+-----------------|
| John         | Smith       | IT                |               1 |
| Sarah        | Johnson     | Marketing         |               2 |
| Michael      | Brown       | IT                |               1 |
| Emily        | Davis       | Finance           |               3 |
| David        | Wilson      | Marketing         |               2 |
| Lisa         | Anderson    | HR                |               4 |
| James        | Taylor      | IT                |               1 |
| Emma         | Martinez    | Marketing         |               2 |
| Daniel       | Thomas      | Finance           |               3 |
| Jessica      | Garcia      | Sales             |               5 |
+--------------+-------------+-------------------+-----------------+

In [33]:
#left Join - returns all the data from the left table

mycursor.execute("""SELECT e.first_name,e.last_name,p.project_name,p.project_id
FROM test.employees e
left JOIN test.projects p ON e.emp_id=p.emp_id""")
out=mycursor.fetchall()   # fetching all the data
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))   # psql is like

+--------------+-------------+--------------------+--------------+
| first_name   | last_name   | project_name       |   project_id |
|--------------+-------------+--------------------+--------------|
| John         | Smith       | Cloud Migration    |            5 |
| John         | Smith       | Website Redesign   |            1 |
| Sarah        | Johnson     | Mobile App         |            2 |
| Michael      | Brown       | DevOps Pipeline    |           10 |
| Michael      | Brown       | Database Migration |            3 |
| Emily        | Davis       | Security Audit     |            4 |
| David        | Wilson      | AI Implementation  |            6 |
| Lisa         | Anderson    |                    |              |
| James        | Taylor      | CRM Update         |            7 |
| Emma         | Martinez    | Network Upgrade    |            8 |
| Daniel       | Thomas      | Data Analytics     |            9 |
| Jessica      | Garcia      |                    |              |
+--------------+-------------+--------------------+--------------+

In [38]:
#Multiple JOINs: Get employee details with both department and project information
mycursor.execute(""" SELECT e.first_name, e.last_name, d.department_name, p.project_name, p.status
FROM test.employees e
INNER JOIN test.departments d ON e.department_id = d.department_id
LEFT JOIN test.projects p ON e.emp_id = p.emp_id;""")
out=mycursor.fetchall()   # fetching all the data
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))   # psql is like

+--------------+-------------+-------------------+--------------------+-------------+
| first_name   | last_name   | department_name   | project_name       | status      |
|--------------+-------------+-------------------+--------------------+-------------|
| John         | Smith       | IT                | Cloud Migration    | Planning    |
| John         | Smith       | IT                | Website Redesign   | In Progress |
| Sarah        | Johnson     | Marketing         | Mobile App         | Planning    |
| Michael      | Brown       | IT                | DevOps Pipeline    | In Progress |
| Michael      | Brown       | IT                | Database Migration | Completed   |
| Emily        | Davis       | Finance           | Security Audit     | In Progress |
| David        | Wilson      | Marketing         | AI Implementation  | On Hold     |
| Lisa         | Anderson    | HR                |                    |             |
| James        | Taylor      | IT                | CRM Update         | In Progress |
| Emma         | Martinez    | Marketing         | Network Upgrade    | Planning    |
| Daniel       | Thomas      | Finance           | Data Analytics     | Completed   |
| Jessica      | Garcia      | Sales             |                    |             |
+--------------+-------------+-------------------+--------------------+-------------+

In [46]:
#JOIN with GROUP BY: Count number of employees in each department
mycursor.execute(""" SELECT d.department_name, COUNT(e.emp_id) as employee_count, AVG(e.salary) as avg_salary
FROM test.departments d
LEFT JOIN test.employees e ON d.department_id = e.department_id
GROUP BY d.department_name;""")
out=mycursor.fetchall()   # fetching all the data
from tabulate import tabulate
print(tabulate(out,headers=[i[0] for i in mycursor.description],  tablefmt='psql'))   # psql is like

+-------------------+------------------+--------------+
| department_name   |   employee_count |   avg_salary |
|-------------------+------------------+--------------|
| Finance           |                2 |      49500   |
| Research          |                0 |              |
| Operations        |                0 |              |
| HR                |                1 |      53000   |
| Sales             |                1 |      57000   |
| Development       |                0 |              |
| Legal             |                0 |              |
| IT                |                3 |      53000   |
| Marketing         |                3 |      60666.7 |
| Support           |                0 |              |
+-------------------+------------------+--------------+

In [47]:
#update - update the data
#set - used to set the value
#where - used to specify the condition

mycursor.execute("update test.employees set salary=60000 where emp_id=1")
connection.commit()